#SQL Functions Assignment

Q1. Create a ranking of students based on score (highest first)

Ans:We have to show of students based on score(Highest first) are

    SELECT
      student_id,
      name,
      score,
      RANK() OVER (ORDER BY score DESC) AS score_rank
    FROM Student_Performance;

Q2. Show each student’s score and the previous student’s score (based on score order).

Ans: We have to show that student score and the previous students score (based on score order) are

    SELECT
       student_id,
       name,
       score,
       LAG(score) OVER (ORDER BY score DESC) AS previous_score
    FROM Student_Performance;

Q3. Convert all student names to uppercase and extract the mentor name from join_date

(Mentor already exists, so only name uppercase is logical).

Ans:To all the student names to uppercase and extract the mentor name form join date are


    SELECT
       student_id,
       UPPER(name) AS student_name,
       mentor,
       join_date
    FROM Student_Performance;

Q4. Show each student’s name and the next student’s attendance (ordered by attendance)

Ans: We have to show that name and attendance ordered for the studend are

    SELECT
       name,
       attendance,
       LEAD(attendance) OVER (ORDER BY attendance) AS next_attendance
    FROM Student_Performance;

Q5. Assign students into 4 performance groups using NTILE()

Ans: We have to assign student into 4 performances group using NTILE() are

    SELECT
        name,
        score,
        NTILE(4) OVER (ORDER BY score DESC) AS performance_group
    FROM Student_Performance;

Q6. For each course, assign a row number based on attendance (highest first).

Ans: We have to show that for each course assign a row number baseds on attendences are

    SELECT
      course,
      name,
      attendance,
      ROW_NUMBER() OVER (PARTITION BY course ORDER BY attendance DESC) AS row_num
    FROM Student_Performance;

Q7. Calculate number of days each student has been enrolled (from join_date to today)


Assume current date = 2025-01-06

Ans: We have to calculate the number of days each student has been enrolled are

    SELECT
       name,
       join_date,
       DATEDIFF('2025-01-06', join_date) AS days_enrolled
    FROM Student_Performance;

Q8. Format join_date as “Month Year” (e.g., June 2023).

Ans: We have to format join date as "Month Year"(e.g., June 2023)are

    SELECT
       name,
       DATE_FORMAT(join_date, '%M %Y') AS join_month_year
    FROM Student_Performance;

Q9. Replace the city “Mumbai” with “MUM” for display purposes

Ans: We have to replace the city "Mumbai" with "MUM" for display purpose are

    SELECT
        name,
        REPLACE(city, 'Mumbai', 'MUM') AS city_display
    FROM Student_Performance;

Q10. For each course, find the highest score using FIRST_VALUE()

Ans: We have to find the FIRST VALUE of highest score in the course are

    SELECT
      course,
      name,
      score,
      FIRST_VALUE(score) OVER (PARTITION BY course ORDER BY score DESC) AS highest_score_in_course
    FROM Student_Performance;